In [1]:
import pandas as pd
import numpy as np

In [2]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [6]:
# df['컬럼명']
# df['eng'].sum()
df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [7]:
df.eng #df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [8]:
df[ ['eng','math'] ]

   eng  math
a   10    90
b   30    50
c   50    20
d   70    70

In [10]:
df[ ['eng'] ]

   eng
a   10
b   30
c   50
d   70

In [11]:
df[ 0:3 ] #슬라이싱( row(index) )

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [13]:
df['a':'c']

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [14]:
df.iloc[0]

eng     10
kor     20
math    90
Name: a, dtype: int64

In [15]:
df.iloc[1]

eng     30
kor     40
math    50
Name: b, dtype: int64

In [17]:
#df.iloc[ 0-base인덱스, 0-base컬럼]
df.iloc[0]

eng     10
kor     20
math    90
Name: a, dtype: int64

In [16]:
df.iloc[0,0]

10

In [18]:
df.iloc[ 1:]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [19]:
df.iloc[ 1:,1:]

   kor  math
b   40    50
c   60    20
d   80    70

In [20]:
df.iloc[ [0,2,3] ]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [21]:
df.iloc[ [0,2,3],[0,2] ]

   eng  math
a   10    90
c   50    20
d   70    70

In [22]:
# df.loc[부여된인덱,부여된컬럼]
df.loc['a']

eng     10
kor     20
math    90
Name: a, dtype: int64

In [23]:
df.loc['b':]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [24]:
df.loc['a','eng']

10

In [25]:
df.loc['b':,'kor':]

   kor  math
b   40    50
c   60    20
d   80    70

In [26]:
df.loc[ ['a','c','d'] ]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [27]:
df.loc[ ['a','c','d'],['eng','math'] ]

   eng  math
a   10    90
c   50    20
d   70    70

In [29]:
df.loc[:, 'eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [28]:
df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [12]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70